[
    {
        "title": "Bridget Jones's Diary (Bridget Jones #1)",
        "price": "£29.82",
        "stock": "1",
        "description": "Meet Bridget Jones—a 30-something Singleton who is certain she would have all the answers if she could:a. lose 7 poundsb. stop smokingc. develop Inner Poise\"123 lbs. (how is it possible to put on 4 pounds in the middle of the night? Could flesh have somehow solidified becoming denser and heavier? Repulsive, horrifying notion), alcohol units 4 (excellent), cigarettes 21 (po Meet Bridget Jones—a 30-something Singleton who is certain she would have all the answers if she could:a. lose 7 poundsb. stop smokingc. develop Inner Poise\"123 lbs. (how is it possible to put on 4 pounds in the middle of the night? Could flesh have somehow solidified becoming denser and heavier? Repulsive, horrifying notion), alcohol units 4 (excellent), cigarettes 21 (poor but will give up totally tomorrow), number of correct lottery numbers 2 (better, but nevertheless useless)...\"Bridget Jones' Diary is the devastatingly self-aware, laugh-out-loud daily chronicle of Bridget's permanent, doomed quest for self-improvement — a year in which she resolves to: reduce the circumference of each thigh by 1.5 inches, visit the gym three times a week not just to buy a sandwich, form a functional relationship with a responsible adult, and learn to program the VCR.Over the course of the year, Bridget loses a total of 72 pounds but gains a total of 74. She remains, however, optimistic. Through it all, Bridget will have you helpless with laughter, and — like millions of readers the world round — you'll find yourself shouting, \"Bridget Jones is me!\" ...more"
    },
    {
        "title": "Eligible (The Austen Project #4)",
        "price": "£27.09",
        "stock": "14",
        "description": "A Modern Retelling of Pride and PrejudiceThis version of the Bennet family—and Mr. Darcy—is one that you have and haven’t met before: Liz is a magazine writer in her late thirties who, like her yoga instructor older sister, Jane, lives in New York City. When their father has a health scare, they return to their childhood home in Cincinnati to help—and discover that the spr A Modern Retelling of Pride and PrejudiceThis version of the Bennet family—and Mr. Darcy—is one that you have and haven’t met before: Liz is a magazine writer in her late thirties who, like her yoga instructor older sister, Jane, lives in New York City. When their father has a health scare, they return to their childhood home in Cincinnati to help—and discover that the sprawling Tudor they grew up in is crumbling and the family is in disarray.Youngest sisters Kitty and Lydia are too busy with their CrossFit workouts and Paleo diets to get jobs. Mary, the middle sister, is earning her third online master’s degree and barely leaves her room, except for those mysterious Tuesday-night outings she won’t discuss. And Mrs. Bennet has one thing on her mind: how to marry off her daughters, especially as Jane’s fortieth birthday fast approaches.Enter Chip Bingley, a handsome new-in-town doctor who recently appeared on the juggernaut reality TV dating show Eligible. At a Fourth of July barbecue, Chip takes an immediate interest in Jane, but Chip’s friend neurosurgeon Fitzwilliam Darcy reveals himself to Liz to be much less charming. . . .And yet, first impressions can be deceiving. ...more"
    },
    {
        "title": "I Am Pilgrim (Pilgrim #1)",
        "price": "£10.60",
        "stock": "14",
        "description": "A breakneck race against time...and an implacable enemy.An anonymous young woman murdered in a run-down hotel, all identifying characteristics dissolved by acid. A father publicly beheaded in the blistering heat of a Saudi Arabian public square. A notorious Syrian biotech expert found eyeless in a Damascus junkyard. Smoldering human remains on a remote mountainside in Afgh A breakneck race against time...and an implacable enemy.An anonymous young woman murdered in a run-down hotel, all identifying characteristics dissolved by acid. A father publicly beheaded in the blistering heat of a Saudi Arabian public square. A notorious Syrian biotech expert found eyeless in a Damascus junkyard. Smoldering human remains on a remote mountainside in Afghanistan. A flawless plot to commit an appalling crime against humanity. One path links them all, and only one man can make the journey.Pilgrim. ...more"
    },
    {
        "title": "Mr. Mercedes (Bill Hodges Trilogy #1)",
        "price": "£28.90",
        "stock": "14",
        "description": "In the frigid pre-dawn hours, in a distressed Midwestern city, hundreds of desperate unemployed folks are lined up for a spot at a job fair. Without warning, a lone driver plows through the crowd in a stolen Mercedes, running over the innocent, backing up, and charging again. Eight people are killed; fifteen are wounded. The killer escapes.In another part of town, months l In the frigid pre-dawn hours, in a distressed Midwestern city, hundreds of desperate unemployed folks are lined up for a spot at a job fair. Without warning, a lone driver plows through the crowd in a stolen Mercedes, running over the innocent, backing up, and charging again. Eight people are killed; fifteen are wounded. The killer escapes.In another part of town, months later, a retired cop named Bill Hodges is still haunted by the unsolved crime. When he gets a crazed letter from someone who self-identifies as the \"perk\" and threatens an even more diabolical attack, Hodges wakes up from his depressed and vacant retirement, hell-bent on preventing another tragedy.Brady Hartfield lives with his alcoholic mother in the house where he was born. He loved the feel of death under the wheels of the Mercedes, and he wants that rush again.Only Bill Hodges, with a couple of highly unlikely allies, can apprehend the killer before he strikes again. And they have no time to lose, because Brady’s next mission, if it succeeds, will kill or maim thousands.Mr. Mercedes is a war between good and evil, from the master of suspense whose insight into the mind of this obsessed, insane killer is chilling and unforgettable. ...more"
    },
    {
        "title": "The Day the Crayons Came Home (Crayons)",
        "price": "£26.33",
        "stock": "3",
        "description": "The companion to the #1 blockbuster bestseller, The Day the Crayons Quit! I'm not sure what it is about this kid Duncan, but his crayons sure are a colorful bunch of characters! Having soothed the hurt feelings of one group who threatened to quit, Duncan now faces a whole new group of crayons asking to be rescued. From Maroon Crayon, who was lost beneath the sofa cushions The companion to the #1 blockbuster bestseller, The Day the Crayons Quit! I'm not sure what it is about this kid Duncan, but his crayons sure are a colorful bunch of characters! Having soothed the hurt feelings of one group who threatened to quit, Duncan now faces a whole new group of crayons asking to be rescued. From Maroon Crayon, who was lost beneath the sofa cushions and then broken in two after Dad sat on him; to poor Turquoise, whose head is now stuck to one of Duncan's stinky socks after they both ended up in the dryer together; to Pea Green, who knows darn well that no kid likes peas and who ran away—each and every crayon has a woeful tale to tell and a plea to be brought home to the crayon box. Drew Daywalt and Oliver Jeffers have combined to create a companion book every bit as funny and kid-friendly as the #1 bestselling The Day the Crayons Quit.Praise for The Day the Crayons Quit The #1 New York Times bestselling phenomenon — over 80 weeks on the bestseller list!Winner of the E.B. White Read-Aloud Award Amazon’s 2013 Best Picture Book of the Year A Barnes & Noble Best Book of 2013 Goodreads’ 2013 Best Picture Book of the Year  * “Hilarious . . . Move over, Click, Clack, Moo; we’ve got a new contender for the most successful picture-book strike.” –BCCB, starred review  “Jeffers . . . elevates crayon drawing to remarkable heights.” –Booklist “Fresh and funny.” –The Wall Street Journal \"This book will have children asking to have it read again and again.” –Library Media Connection * “This colorful title should make for an uproarious storytime.” –School Library Journal, starred review  * “These memorable personalities will leave readers glancing apprehensively at their own crayon boxes.” –Publishers Weekly, starred review  “Utterly original.” –San Francisco Chronicle ...more"
    },
    {
        "title": "The Lonely Ones",
        "price": "£43.59",
        "stock": "3",
        "description": "When your only friend is your own endless imagination, how do you escape your mind and connect to the world around you?With parents too busy to pay her attention, an older brother and sister who would rather spend their time with friends, and peers who oscillate between picking on her and simply ignoring her, it's no wonder that Fain spends most of her time in a world of h When your only friend is your own endless imagination, how do you escape your mind and connect to the world around you? With parents too busy to pay her attention, an older brother and sister who would rather spend their time with friends, and peers who oscillate between picking on her and simply ignoring her, it's no wonder that Fain spends most of her time in a world of her own making. During the day, Fain takes solace in crafting her own fantastical adventures in writing, but in the darkness of night, these adventures come to life as Fain lives and breathes alongside a legion of imaginary creatures. Whether floating through space or under the sea, climbing mountains or traipsing through forests, Fain becomes queen beyond - and in spite of - the walls of her bedroom.In time, Fain begins to see possibilities and friendships emerge in her day-to-day reality. . . yet when she is let down by the one relationship she thought she could trust, Fain must decide: remain queen of the imaginary creatures, or risk the pain that comes with opening herself up to the fragile connections that exist only in the real world? Told in breathless and visual verse, THE LONELY ONES takes readers through the intricate inner workings of a girl who struggles to navigate isolation and finds friendship where she least expects it. ...more"
    },
    {
        "title": "The Thing About Jellyfish",
        "price": "£48.77",
        "stock": "3",
        "description": "This stunning debut novel about grief and wonder was an instant New York Times bestseller and captured widespread critical acclaim, including selection as a 2015 National Book Award finalist! After her best friend dies in a drowning accident, Suzy is convinced that the true cause of the tragedy must have been a rare jellyfish sting-things don't just happen for no reason. R This stunning debut novel about grief and wonder was an instant New York Times bestseller and captured widespread critical acclaim, including selection as a 2015 National Book Award finalist! After her best friend dies in a drowning accident, Suzy is convinced that the true cause of the tragedy must have been a rare jellyfish sting-things don't just happen for no reason. Retreating into a silent world of imagination, she crafts a plan to prove her theory--even if it means traveling the globe, alone. Suzy's achingly heartfelt journey explores life, death, the astonishing wonder of the universe...and the potential for love and hope right next door. ...more"
    },
    {
        "title": "The Wild Robot",
        "price": "£56.07",
        "stock": "3",
        "description": "When robot Roz opens her eyes for the first time, she discovers that she is alone on a remote, wild island. Why is she there? Where did she come from? And, most important, how will she survive in her harsh surroundings? Roz's only hope is to learn from the island's hostile animal inhabitants. When she tries to care for an orphaned gosling, the other animals finally decide When robot Roz opens her eyes for the first time, she discovers that she is alone on a remote, wild island. Why is she there? Where did she come from? And, most important, how will she survive in her harsh surroundings? Roz's only hope is to learn from the island's hostile animal inhabitants. When she tries to care for an orphaned gosling, the other animals finally decide to help, and the island starts to feel like home. Until one day, the robot's mysterious past comes back to haunt her.... ...more"
    },
    {
        "title": "Maybe Something Beautiful: How Art Transformed a Neighborhood",
        "price": "£22.54",
        "stock": "5",
        "description": "What good can a splash of color do in a community of gray? As Mira and her neighbors discover, more than you might ever imagine! Based on the true story of the Urban Art Trail in San Diego, California, Maybe Something Beautiful reveals how art can inspire transformation—and how even the smallest artists can accomplish something big. Pick up a paintbrush and join the celebr What good can a splash of color do in a community of gray? As Mira and her neighbors discover, more than you might ever imagine! Based on the true story of the Urban Art Trail in San Diego, California, Maybe Something Beautiful reveals how art can inspire transformation—and how even the smallest artists can accomplish something big. Pick up a paintbrush and join the celebration!   ...more"
    },
    {
        "title": "Playing from the Heart",
        "price": "£32.38",
        "stock": "7",
        "description": "Peter H. Reynolds, creator of The Dot, has composed a pitch-perfect tribute to the power of music and the bonds of family.When a young boy begins to play on his family’s piano, reveling in the fun of plunking the keys, his father signs him up for lessons so that he can learn to play properly. With his father’s encouragement, Raj learns notes, then scales, then songs, and Peter H. Reynolds, creator of The Dot, has composed a pitch-perfect tribute to the power of music and the bonds of family.When a young boy begins to play on his family’s piano, reveling in the fun of plunking the keys, his father signs him up for lessons so that he can learn to play properly. With his father’s encouragement, Raj learns notes, then scales, then songs, and finally classical pieces that his father can recognize and be proud of. But the more Raj practices and the more skilled he becomes, the less he enjoys playing, until he grows up and stops playing altogether. But when his father becomes ill and asks Raj to play for him, will Raj remember how to play from the heart? ...more"
    },
    {
        "title": "Raymie Nightingale",
        "price": "£34.41",
        "stock": "7",
        "description": "Raymie Clarke has come to realize that everything, absolutely everything, depends on her. And she has a plan. If Raymie can win the Little Miss Central Florida Tire competition, then her father, who left town two days ago with a dental hygienist, will see Raymie's picture in the paper and (maybe) come home. To win, not only does Raymie have to do good deeds and learn how t Raymie Clarke has come to realize that everything, absolutely everything, depends on her. And she has a plan. If Raymie can win the Little Miss Central Florida Tire competition, then her father, who left town two days ago with a dental hygienist, will see Raymie's picture in the paper and (maybe) come home. To win, not only does Raymie have to do good deeds and learn how to twirl a baton; she also has to contend with the wispy, frequently fainting Louisiana Elefante, who has a show-business background, and the fiery, stubborn Beverly Tapinski, who’s determined to sabotage the contest. But as the competition approaches, loneliness, loss, and unanswerable questions draw the three girls into an unlikely friendship — and challenge each of them to come to the rescue in unexpected ways. ...more"
    },
    {
        "title": "Girl in the Blue Coat",
        "price": "£46.83",
        "stock": "3",
        "description": "Amsterdam, 1943. Hanneke spends her days finding and delivering sought-after black market goods to paying customers, nights hiding the true nature of her work from her concerned parents, and every waking moment mourning her boyfriend, who was killed on the Dutch front lines when the German army invaded. Her illegal work keeps her family afloat, and Hanneke also likes to th Amsterdam, 1943. Hanneke spends her days finding and delivering sought-after black market goods to paying customers, nights hiding the true nature of her work from her concerned parents, and every waking moment mourning her boyfriend, who was killed on the Dutch front lines when the German army invaded. Her illegal work keeps her family afloat, and Hanneke also likes to think of it as a small act of rebellion against the Nazis.On a routine delivery, a client asks Hanneke for help. Expecting to hear that Mrs. Janssen wants meat or kerosene, Hanneke is shocked by the older woman’s frantic plea to find a person: a Jewish teenager Mrs. Janssen had been hiding, who has vanished without a trace from a secret room. Hanneke initially wants nothing to do with such a dangerous task but is ultimately drawn into a web of mysteries and stunning revelations—where the only way out is through.Beautifully written, intricately plotted, and meticulously researched, Girl in the Blue Coat is an extraordinary, unforgettable story of bravery, grief, and love in impossible times. ...more"
    },
    {
        "title": "The Guernsey Literary and Potato Peel Pie Society",
        "price": "£49.53",
        "stock": "3",
        "description": "“ I wonder how the book got to Guernsey? Perhaps there is some sort of secret homing instinct in books that brings them to their perfect readers.” January 1946: London is emerging from the shadow of the Second World War, and writer Juliet Ashton is looking for her next book subject. Who could imagine that she would find it in a letter from a man she’s never met, a native o “ I wonder how the book got to Guernsey? Perhaps there is some sort of secret homing instinct in books that brings them to their perfect readers.” January 1946: London is emerging from the shadow of the Second World War, and writer Juliet Ashton is looking for her next book subject. Who could imagine that she would find it in a letter from a man she’s never met, a native of the island of Guernsey, who has come across her name written inside a book by Charles Lamb….As Juliet and her new correspondent exchange letters, Juliet is drawn into the world of this man and his friends—and what a wonderfully eccentric world it is. The Guernsey Literary and Potato Peel Pie Society—born as a spur-of-the-moment alibi when its members were discovered breaking curfew by the Germans occupying their island—boasts a charming, funny, deeply human cast of characters, from pig farmers to phrenologists, literature lovers all.Juliet begins a remarkable correspondence with the society’s members, learning about their island, their taste in books, and the impact the recent German occupation has had on their lives. Captivated by their stories, she sets sail for Guernsey, and what she finds will change her forever.Written with warmth and humor as a series of letters, this novel is a celebration of the written word in all its guises, and of finding connection in the most surprising ways. ...more"
    },
    {
        "title": "Forever Rockers (The Rocker #12)",
        "price": "£28.80",
        "stock": "1",
        "description": "My Happily Ever After was turning into a living nightmare... All I wanted was Harper's happiness and I would move the world to give her anything she ever wanted. We've searched for answers, talked about our options, and finally-FINALLY-found hope. Yet, just when things seemed to be perfect, it all came crashing down around us all. The one person I've always counted on to h My Happily Ever After was turning into a living nightmare... All I wanted was Harper's happiness and I would move the world to give her anything she ever wanted. We've searched for answers, talked about our options, and finally-FINALLY-found hope. Yet, just when things seemed to be perfect, it all came crashing down around us all. The one person I've always counted on to hold us together-to hold me together-was lost in her own nightmares and I felt like I was losing everything. Everything. I wasn't going to lose the woman I loved. I would hold onto her until the last breath left my body. It was my mistakes that were hurting us and I would be the one to fix it. I wouldn't let my past ruin my forever with Harper. ...more"
    },
    {
        "title": "Old Records Never Die: One Man's Quest for His Vinyl and His Past",
        "price": "£55.66",
        "stock": "1",
        "description": "Foreword by Wilco's Jeff Tweedy\"Memories are far more indelible when married to the physical world, and Spitznagel proves the point in this vivid book. We love vinyl records because they combine the tactile, the visual, the seeable effects of age and care and carelessless. When he searches for the records he lost and sold,Spitznagel istrying to return to a tangible past, a Foreword by Wilco's Jeff Tweedy\"Memories are far more indelible when married to the physical world, and Spitznagel proves the point in this vivid book. We love vinyl records because they combine the tactile, the visual, the seeable effects of age and care and carelessless. When he searches for the records he lost and sold, Spitznagel is trying to return to a tangible past, and he details that process with great sensitivity and impact.\"—Dave Eggers, author of The CircleHigh Fidelity meets Killing Yourself to Live in this memoir of one man's search for his lost record collection. As he finds himself within spitting distance of middle-age, journalist Eric Spitznagel feels acutely the loss of…something. Freedom? Maybe. Coolness? Could be. The records he sold in a financial pinch? Definitely. To find out for sure, he sets out on a quest to find  the original vinyl artifacts from his past. Not just copies. The exact same records: The Bon Jovi record with his first girlfriend's phone number scrawled on the front sleeve. The KISS Alive II he once shared with his little brother. The Replacements Let It Be he’s pretty sure, 20 years later, would still smell like weed. As he embarks on his hero's journey, he reminisces about the actual records, the music, and the people he listened to it with—old girlfriends, his high school pals, and, most poignantly, his father and his young son. He explores the magic of music and memory as he interweaves his adventures in record- culture with questions about our connection to our past, whether we can ever recapture it, and whether we would want to if we could. ...more"
    },
    {
        "title": "Life",
        "price": "£31.58",
        "stock": "2",
        "description": "With the Rolling Stones, Keith Richards created the riffs, the lyrics and the songs that roused the world, and over four decades he lived the original rock and roll life. Now, at last, the man himself tells us the story of life in the crossfire hurricane."
    },
    {
        "title": "No One Here Gets Out Alive",
        "price": "£20.02",
        "stock": "4",
        "description": "Here is Jim Morrison in all his complexity-singer, philosopher, poet, delinquent-the brilliant, charismatic, and obsessed seeker who rejected authority in any form, the explorer who probed \"the bounds of reality to see what would happen...\" Seven years in the writing, this definitive biography is the work of two men whose empathy and experience with Jim Morrison uniquely p Here is Jim Morrison in all his complexity-singer, philosopher, poet, delinquent-the brilliant, charismatic, and obsessed seeker who rejected authority in any form, the explorer who probed \"the bounds of reality to see what would happen...\" Seven years in the writing, this definitive biography is the work of two men whose empathy and experience with Jim Morrison uniquely prepared them to recount this modern tragedy: Jerry Hopkins, whose famous Presley biography, Elvis, was inspired by Morrison's suggestion, and Danny Sugerman, confidant of and aide to the Doors. With an afterword by Michael McClure. ...more"
    },
    {
        "title": "Orchestra of Exiles: The Story of Bronislaw Huberman, the Israel Philharmonic, and the One Thousand Jews He Saved from Nazi Horrors",
        "price": "£12.36",
        "stock": "4",
        "description": "The compelling biography of the violinist who founded the Palestine Symphony Orchestra and saved hundreds of people from Hitler—as seen in Josh Aronson’s documentary Orchestra of Exiles.“The true artist does not create art as an end in itself. He creates art for human beings. Humanity is the goal.”—Bronislaw HubermanAt fourteen, Bronislaw Huberman played the Brahms Violin The compelling biography of the violinist who founded the Palestine Symphony Orchestra and saved hundreds of people from Hitler—as seen in Josh Aronson’s documentary Orchestra of Exiles.“The true artist does not create art as an end in itself. He creates art for human beings. Humanity is the goal.”—Bronislaw HubermanAt fourteen, Bronislaw Huberman played the Brahms Violin Concerto in Vienna— winning high praise from the composer himself, who was there. Instantly famous, Huberman began touring all over the world and received invitations to play for royalty across Europe. But after witnessing the tragedy of World War I, he committed his phenomenal talent and celebrity to aid humanity.After studying at the Sorbonne in Paris, Huberman joined the ranks of Sigmund Freud and Albert Einstein in calling for peace through the Pan European Movement. But when hope for their noble vision was destroyed by the rise of Nazism, Huberman began a crusade that would become his greatest legacy—the creation, in 1936, of the Palestine Symphony, which twelve years later became the Israel Philharmonic Orchestra.In creating this world-level orchestra, Huberman miraculously arranged for the very best Jewish musicians and their families to emigrate from Nazi-threatened territories. His tireless campaigning for the project—including a marathon fundraising concert tour across America—ultimately saved nearly a thousand Jews from the approaching Holocaust. Inviting the great Arturo Toscanini to conduct the orchestra’s first concert, Huberman’s clarion call of art over cruelty was heard around the world. His story contains estraordinary adventures, riches and royalty, politicians and broken promises, losses and triumphs. Against near impossible obstacles, Huberman refused to give up on his dream to create a unique and life-saving orchestra of exiles which was one of the great cultural achievements of the 20th century.Includes Photographs ...more"
    },
    {
        "title": "This Is Your Brain on Music: The Science of a Human Obsession",
        "price": "£38.40",
        "stock": "5",
        "description": "Whether you load your iPod with Bach or Bono, music has a significant role in your life—even if you never realized it. Why does music evoke such powerful moods? The answers are at last be- coming clear, thanks to revolutionary neuroscience and the emerging field of evolutionary psychology. Both a cutting-edge study and a tribute to the beauty of music itself, This Is Your Whether you load your iPod with Bach or Bono, music has a significant role in your life—even if you never realized it. Why does music evoke such powerful moods? The answers are at last be- coming clear, thanks to revolutionary neuroscience and the emerging field of evolutionary psychology. Both a cutting-edge study and a tribute to the beauty of music itself, This Is Your Brain on Music unravels a host of mysteries that affect everything from pop culture to our understanding of human nature, including: • Are our musical preferences shaped in utero? • Is there a cutoff point for acquiring new tastes in music? • What do PET scans and MRIs reveal about the brain’s response to music? • Is musical pleasure different from other kinds of pleasure?This Is Your Brain on Music explores cultures in which singing is considered an essential human function, patients who have a rare disorder that prevents them from making sense of music, and scientists studying why two people may not have the same definition of pitch. At every turn, this provocative work unlocks deep secrets about how nature and nurture forge a uniquely human obsession. ...more"
    },
    {
        "title": "You can't bury them all: Poems",
        "price": "£33.63",
        "stock": "17",
        "description": "A poetry that is at once harrowing, angry, and achingly beautiful Patrick Woodcock has spent the past seven years engaging with and being shaped by the people, politics, and landscapes of the Kurdish north of Iraq, Fort Good Hope in the Northwest Territories, and Azerbaijan. His powerful new collection offers a poetry that simultaneously explores hope and horror while doc A poetry that is at once harrowing, angry, and achingly beautiful Patrick Woodcock has spent the past seven years engaging with and being shaped by the people, politics, and landscapes of the Kurdish north of Iraq, Fort Good Hope in the Northwest Territories, and Azerbaijan. His powerful new collection offers a poetry that simultaneously explores hope and horror while documenting the transformative processes of coping. You can’t bury them all follows the narratives we construct to survive the tragic failures of our humanity to their very end: everything that’s buried by snow, dirt, and ash, just like everything that’s buried by politics, homophobia, sexism, racism, religion; and history is resurrected, demanding to be heard and addressed.In Woodcock’s poetry, how we deal with what resurfaces is the key. What do those who suffer really mean to those who have abandoned them to small, conscience-soothing charitable donations or the occasional tweet? How can the poet, or anyone else, sleep at night knowing homosexuals are being thrown off building tops, after one steps into a hole and finds an abandoned corpse in an Azeri cemetery, or after the elders of an Aboriginal community are left helpless against those who only want to exploit them? Still, You can’t bury them all demonstrates that the world is not just the horrific place the media often portrays. In each of the worlds he touches, Woodcock discovers a spirit and strength to celebrate. ...more"
    },
    {
        "title": "So You've Been Publicly Shamed",
        "price": "£12.23",
        "stock": "15",
        "description": "For the past three years, Jon Ronson has traveled the world meeting recipients of high-profile public shamings. The shamed are people like us, people who, say, made a joke on social media that came out badly or made a mistake at work. Once the transgression is revealed, collective outrage circles with the force of a hurricane and the next thing they know, they're being tor For the past three years, Jon Ronson has traveled the world meeting recipients of high-profile public shamings. The shamed are people like us, people who, say, made a joke on social media that came out badly or made a mistake at work. Once the transgression is revealed, collective outrage circles with the force of a hurricane and the next thing they know, they're being torn apart by an angry mob, jeered at, demonized, sometimes even fired from their job.A great renaissance of public shaming is sweeping our land. Justice has been democratized. The silent majority are getting a voice, but what are we doing with our voice? We are mercilessly finding people's faults. We are defining the boundaries of normality by ruining the lives of those outside it. We are using shame as a form of social control.Simultaneously powerful and hilarious in the way only Jon Ronson can be, So You've Been Publicly Shamed is a deeply honest book about modern life, full of eye-opening truths about the escalating war on human flaws and the very scary part we all play in it. ...more"
    },
    {
        "title": "The Artist's Way: A Spiritual Path to Higher Creativity",
        "price": "£38.49",
        "stock": "15",
        "description": "\"Without The Artist's Way, there would have been no Eat, Pray, Love.” —Elizabeth GilbertThe Artist’s Way is the seminal book on the subject of creativity. An international bestseller, millions of readers have found it to be an invaluable guide to living the artist’s life. Still as vital today—or perhaps even more so—than it was when it was first published one decade ago, i \"Without The Artist's Way, there would have been no Eat, Pray, Love.” —Elizabeth GilbertThe Artist’s Way is the seminal book on the subject of creativity. An international bestseller, millions of readers have found it to be an invaluable guide to living the artist’s life. Still as vital today—or perhaps even more so—than it was when it was first published one decade ago, it is a powerfully provocative and inspiring work. In a new introduction to the book, Julia Cameron reflects upon the impact of The Artist’s Way and describes the work she has done during the last decade and the new insights into the creative process that she has gained. Updated and expanded, this anniversary edition reframes The Artist’s Way for a new century. ...more"
    },
    {
        "title": "The Genius of Birds",
        "price": "£17.24",
        "stock": "15",
        "description": "Birds are astonishingly intelligent creatures. In fact, according to revolutionary new research, some birds rival primates and even humans in their remarkable forms of intelligence. Like humans, many birds have enormous brains relative to their size. Although small, bird brains are packed with neurons that allow them to punch well above their weight. InThe Genius of Birds, Birds are astonishingly intelligent creatures. In fact, according to revolutionary new research, some birds rival primates and even humans in their remarkable forms of intelligence.  Like humans, many birds have enormous brains relative to their size. Although small, bird brains are packed with neurons that allow them to punch well above their weight. In The Genius of Birds, acclaimed author Jennifer Ackerman explores the newly discovered brilliance of birds and how it came about. As she travels around the world to the most cutting-edge frontiers of research— the distant laboratories of Barbados and New Caledonia, the great tit communities of the United Kingdom and the bowerbird habitats of Australia, the ravaged mid-Atlantic coast after Hurricane Sandy and the warming mountains of central Virginia and the western states—Ackerman not only tells the story of the recently uncovered genius of birds but also delves deeply into the latest findings about the bird brain itself that are revolutionizing our view of what it means to be intelligent.Consider, as Ackerman does, the Clark’s nutcracker, a bird that can hide as many as 30,000 seeds over dozens of square miles and remember where it put them several months later; the mockingbirds and thrashers, species that can store 200 to 2,000 different songs in a brain a thousand times smaller than ours; the well-known pigeon, which knows where it’s going, even thousands of miles from familiar territory; and the New Caledonian crow, an impressive bird that makes its own tools. But beyond highlighting how birds use their unique genius in technical ways, Ackerman points out the impressive social smarts of birds. They deceive and manipulate. They eavesdrop. They display a strong sense of fairness. They give gifts. They play keep-away and tug-of-war. They tease. They share. They cultivate social networks. They vie for status. They kiss to console one another. They teach their young. They blackmail their parents. They alert one another to danger. They summon witnesses to the death of a peer. They may even grieve. This elegant scientific investigation and travelogue weaves personal anecdotes with fascinating science. Ackerman delivers an extraordinary story that will both give readers a new appreciation for the exceptional talents of birds and let them discover what birds can reveal about our changing world. Incredibly informative and beautifully written, The Genius of Birds richly celebrates the triumphs of these surprising and fiercely intelligent creatures. ...more"
    },
    {
        "title": "The Omnivore's Dilemma: A Natural History of Four Meals",
        "price": "£38.21",
        "stock": "15",
        "description": "What should we have for dinner?\" To one degree or another this simple question assails any creature faced with a wide choice of things to eat. Anthropologists call it the omnivore's dilemma. Choosing from among the countless potential foods nature offers, humans have had to learn what is safe, and what isn't—which mushrooms should be avoided, for example, and which berries What should we have for dinner?\" To one degree or another this simple question assails any creature faced with a wide choice of things to eat. Anthropologists call it the omnivore's dilemma. Choosing from among the countless potential foods nature offers, humans have had to learn what is safe, and what isn't—which mushrooms should be avoided, for example, and which berries we can enjoy. Today, as America confronts what can only be described as a national eating disorder, the omnivore's dilemma has returned with an atavistic vengeance. The cornucopia of the modern American supermarket and fast-food outlet has thrown us back on a bewildering landscape where we once again have to worry about which of those tasty-looking morsels might kill us. At the same time we're realizing that our food choices also have profound implications for the health of our environment. The Omnivore's Dilemma is bestselling author Michael Pollan's brilliant and eye-opening exploration of these little-known but vitally important dimensions of eating in America. Pollan has divided The Omnivore's Dilemma into three parts, one for each of the food chains that sustain us: industrialized food, alternative or \"organic\" food, and food people obtain by dint of their own hunting, gathering, or gardening. Pollan follows each food chain literally from the ground up to the table, emphasizing our dynamic coevolutionary relationship with the species we depend on. He concludes each section by sitting down to a meal—at McDonald's, at home with his family sharing a dinner from Whole Foods, and in a revolutionary \"beyond organic\" farm in Virginia. For each meal he traces the provenance of everything consumed, revealing the hidden components we unwittingly ingest and explaining how our taste for particular foods reflects our environmental and biological inheritance. We are indeed what we eat-and what we eat remakes the world. A society of voracious and increasingly confused omnivores, we are just beginning to recognize the profound consequences of the simplest everyday food choices, both for ourselves and for the natural world. The Omnivore's Dilemma is a long-overdue book and one that will become known for bringing a completely fresh perspective to a question as ordinary and yet momentous as What shall we have for dinner?A few facts and figures from The Omnivore's Dilemma:Of the 38 ingredients it takes to make a McNugget, there are at least 13 that are derived from corn. 45 different menu items at Mcdonald’s are made from corn. One in every three American children eats fast food every day. One in every five American meals today is eaten in the car. The food industry burns nearly a fifth of all the petroleum consumed in the United States—more than we burn with our cars and more than any other industry consumes. It takes ten calories of fossil fuel energy to deliver one calorie of food energy to an American plate. A single strawberry contains about five calories. To get that strawberry from a field in California to a plate on the east coast requires 435 calories of energy. Industrial fertilizer and industrial pesticides both owe their existence to the conversion of the World War II munitions industry to civilian uses—nerve gases became pesticides, and ammonium nitrate explosives became nitrogen fertilizers. ... ...more"
    },
    {
        "title": "The Power of Now: A Guide to Spiritual Enlightenment",
        "price": "£43.54",
        "stock": "15",
        "description": "Ekhart Tolle's message is simple: living in the now is the truest path to happiness and enlightenment. And while this message may not seem stunningly original or fresh, Tolle's clear writing, supportive voice and enthusiasm make this an excellent manual for anyone who's ever wondered what exactly \"living in the now\" means. Foremost, Tolle is a world-class teacher, able to Ekhart Tolle's message is simple: living in the now is the truest path to happiness and enlightenment. And while this message may not seem stunningly original or fresh, Tolle's clear writing, supportive voice and enthusiasm make this an excellent manual for anyone who's ever wondered what exactly \"living in the now\" means. Foremost, Tolle is a world-class teacher, able to explain complicated concepts in concrete language. More importantly, within a chapter of reading this book, readers are already holding the world in a different container--more conscious of how thoughts and emotions get in the way of their ability to live in genuine peace and happiness.Tolle packs a lot of information and inspirational ideas into The Power of Now. (Topics include the source of Chi, enlightened relationships, creative use of the mind, impermanence and the cycle of life.) Thankfully, he's added markers that symbolise \"break time\". This is when readers should close the book and mull over what they just read. As a result, The Power of Now reads like the highly acclaimed A Course in Miracles--a spiritual guidebook that has the potential to inspire just as many study groups and change just as many lives for the better. --Gail Hudson ...more"
    },
    {
        "title": "Algorithms to Live By: The Computer Science of Human Decisions",
        "price": "£30.81",
        "stock": "16",
        "description": "A fascinating exploration of how insights from computer algorithms can be applied to our everyday lives, helping to solve common decision-making problems and illuminate the workings of the human mindAll our lives are constrained by limited space and time, limits that give rise to a particular set of problems. What should we do, or leave undone, in a day or a lifetime? How A fascinating exploration of how insights from computer algorithms can be applied to our everyday lives, helping to solve common decision-making problems and illuminate the workings of the human mindAll our lives are constrained by limited space and time, limits that give rise to a particular set of problems. What should we do, or leave undone, in a day or a lifetime? How much messiness should we accept? What balance of new activities and familiar favorites is the most fulfilling? These may seem like uniquely human quandaries, but they are not: computers, too, face the same constraints, so computer scientists have been grappling with their version of such issues for decades. And the solutions they've found have much to teach us.In a dazzlingly interdisciplinary work, acclaimed author Brian Christian and cognitive scientist Tom Griffiths show how the algorithms used by computers can also untangle very human questions. They explain how to have better hunches and when to leave things to chance, how to deal with overwhelming choices and how best to connect with others. From finding a spouse to finding a parking spot, from organizing one's inbox to understanding the workings of memory, Algorithms to Live By transforms the wisdom of computer science into strategies for human living. ...more"
    },
    {
        "title": "Everydata: The Misinformation Hidden in the Little Data You Consume Every Day",
        "price": "£54.35",
        "stock": "16",
        "description": "While everyone is talking about “big data,” the truth is that understanding the “little data”—the stats that underlie newspaper headlines, stock reports, weather forecasts, and so on—is what helps you make smarter decisions at work, at home, and in every aspect of your life. The average person consumes approximately 30 gigabytes of data every single day, but has no idea ho While everyone is talking about “big data,” the truth is that understanding the “little data”—the stats that underlie newspaper headlines, stock reports, weather forecasts, and so on—is what helps you make smarter decisions at work, at home, and in every aspect of your life. The average person consumes approximately 30 gigabytes of data every single day, but has no idea how to interpret it correctly. EVERYDATA explains, through the eyes of an expert economist and statistician, how to decipher the small bytes of data we consume in a day.EVERYDATA is filled with countless examples of people misconstruing data—with results that range from merely frustrating to catastrophic:The space shuttle Challenger exploded in part because the engineers were reviewing a limited sample set.Millions of women avoid caffeine during pregnancy because they interpret correlation as causation.Attorneys faced a $1 billion jury verdict because of outlier data.Each chapter highlights one commonly misunderstood data concept, using both realworld and hypothetical examples from a wide range of topics, including business, politics, advertising, law, engineering, retail, parenting, and more. You’ll find the answer to the question—“Now what?”—along with concrete ways you can use this information to immediately start making smarter decisions, today and every day. ...more"
    },
    {
        "title": "Call the Nurse: True Stories of a Country Nurse on a Scottish Isle",
        "price": "£29.14",
        "stock": "16",
        "description": "Tired of the pace and noise of life near London and longing for a better place to raise their young children, Mary J. MacLeod and her husband encountered their dream while vacationing on a remote island in the Scottish Hebrides. Enthralled by its windswept beauty, they soon were the proud owners of a near-derelict croft house--a farmer's stone cottage--on \"a small acre\" of Tired of the pace and noise of life near London and longing for a better place to raise their young children, Mary J. MacLeod and her husband encountered their dream while vacationing on a remote island in the Scottish Hebrides. Enthralled by its windswept beauty, they soon were the proud owners of a near-derelict croft house--a farmer's stone cottage--on \"a small acre\" of land. Mary assumed duties as the island's district nurse. Call the Nurse is her account of the enchanted years she and her family spent there, coming to know its folk as both patients and friends.In anecdotes that are by turns funny, sad, moving, and tragic, she recalls them all, the crofters and their laird, the boatmen and tradesmen, young lovers and forbidding churchmen. Against the old-fashioned island culture and the grandeur of mountain and sea unfold indelible stories: a young woman carried through snow for airlift to the hospital; a rescue by boat; the marriage of a gentle giant and the island beauty; a ghostly encounter; the shocking discovery of a woman in chains; the flames of a heather fire at night; an unexploded bomb from World War II; and the joyful, tipsy celebration of a ceilidh. Gaelic fortitude meets a nurse's compassion in these wonderful true stories from rural Scotland. ...more"
    },
    {
        "title": "In the Country We Love: My Family Divided",
        "price": "£22.00",
        "stock": "16",
        "description": "The star of Orange is the New Black and Jane the Virgin presents her personal story of the real plight of undocumented immigrants in this countryDiane Guerrero, the television actress from the megahit Orange is the New Black and Jane the Virgin, was just fourteen years old on the day her parents and brother were arrested and deported while she was at school. Born in the U. The star of Orange is the New Black and Jane the Virgin presents her personal story of the real plight of undocumented immigrants in this countryDiane Guerrero, the television actress from the megahit Orange is the New Black and Jane the Virgin, was just fourteen years old on the day her parents and brother were arrested and deported while she was at school. Born in the U.S., Guerrero was able to remain in the country and continue her education, depending on the kindness of family friends who took her in and helped her build a life and a successful acting career for herself, without the support system of her family.In the Country We Love is a moving, heartbreaking story of one woman's extraordinary resilience in the face of the nightmarish struggles of undocumented residents in this country. There are over 11 million undocumented immigrants living in the US, many of whom have citizen children, whose lives here are just as precarious, and whose stories haven't been told. Written with Michelle Burford, this memoir is a tale of personal triumph that also casts a much-needed light on the fears that haunt the daily existence of families like the author's and on a system that fails them over and over. ...more"
    },
    {
        "title": "Reskilling America: Learning to Labor in the Twenty-First Century",
        "price": "£19.83",
        "stock": "16",
        "description": "From Katherine Newman, award-winning author of No Shame in My Game, and sociologist Hella Winston, a sharp and irrefutable call to reenergize this nation's long-neglected system of vocational trainingAfter decades of off-shoring and downsizing that have left blue collar workers obsolete and stranded, the United States is now on the verge of an industrial renaissance. But w From Katherine Newman, award-winning author of No Shame in My Game, and sociologist Hella Winston, a sharp and irrefutable call to reenergize this nation's long-neglected system of vocational trainingAfter decades of off-shoring and downsizing that have left blue collar workers obsolete and stranded, the United States is now on the verge of an industrial renaissance. But we don't have a skilled enough labor pool to fill the positions that will be created, which are in many cases technically demanding and require specialized skills. A decades-long series of idealistic educational policies with the expressed goal of getting every student to go to college has left a generation of potential workers out of the system. Touted as a progressive, egalitarian institution providing opportunity even to those with the greatest need, the American secondary school system has in fact deepened existing inequalities.We can do better, argue acclaimed sociologists Katherine Newman and Hella Winston. Taking a page from the successful experience of countries like Germany and Austria, where youth unemployment is a mere 7%, they call for a radical reevaluation of the idea of vocational training, long discredited as an instrument of tracking. The United States can prepare a new, high-performance labor force if we revamp our school system to value industry apprenticeship and rigorous technical education. By doing so, we will not only be able to meet the growing demand for skilled employees in dozens of sectors where employers decry the absence of well trained workers -- we will make the American Dream accessible to all. ...more"
    },
    {
        "title": "Spark Joy: An Illustrated Master Class on the Art of Organizing and Tidying Up",
        "price": "£41.83",
        "stock": "16",
        "description": "Marie Kondo’s unique KonMari Method of tidying up is nothing short of life-changing—and her first book, The Life-Changing Magic of Tidying Up, has become a worldwide sensation. In Spark Joy, Kondo presents an in-depth, illustrated manual on how to declutter and organize specific items throughout the house, from kitchen and bathroom items to work-related papers and hobby co Marie Kondo’s unique KonMari Method of tidying up is nothing short of life-changing—and her first book, The Life-Changing Magic of Tidying Up, has become a worldwide sensation. In Spark Joy, Kondo presents an in-depth, illustrated manual on how to declutter and organize specific items throughout the house, from kitchen and bathroom items to work-related papers and hobby collections. User-friendly line drawings illustrate Kondo’s patented folding method as it applies to shirts, pants, socks, and jackets, as well as images of properly organized drawers, closets, and cabinets. This book is perfect for anyone who wants a home—and life—that sparks joy. ...more"
    },
    {
        "title": "The Electric Pencil: Drawings from Inside State Hospital No. 3",
        "price": "£56.06",
        "stock": "16",
        "description": "Deeds's subtle, meticulous, and wildly imaginative pencil and crayon drawings portray an unusual cast of characters: nineteenth-century dandies, Civil War soldiers, antique cars, fantastic boats and trains, country landscapes dotted with roaming animals, and fanciful architecture. None of these existed in the actual mid-twentieth-century landscape of Deeds's own life, but Deeds's subtle, meticulous, and wildly imaginative pencil and crayon drawings portray an unusual cast of characters: nineteenth-century dandies, Civil War soldiers, antique cars, fantastic boats and trains, country landscapes dotted with roaming animals, and fanciful architecture. None of these existed in the actual mid-twentieth-century landscape of Deeds's own life, but rather were representations of his inner world—an artist's poignant tribute to a faded past.Deeds lovingly bound his artwork in a cardboard and leather portfolio, a present for his mother. After being accidentally discarded in 1970, the album was rescued from the trash by a young boy and, thirty-six years later, came into the hands of artist and collector Harris Diamant, who provides the book's foreword. The Electric Pencil features all 283 of Deeds's arresting drawings—now avidly collected—done on ledger sheets from State Hospital No. 3 in Nevada, Missouri, and reproduced in the sequence of the original album. The Electric Pencil introduces readers to an astonishing record of one man's unwavering artistic vision in the face of the most inhospitable conditions. ...more"
    },
    {
        "title": "The Gutsy Girl: Escapades for Your Life of Epic Adventure",
        "price": "£37.13",
        "stock": "16",
        "description": "Why should girls miss out on the joy of adventure? They can jump off rocks, swing on ropes, and climb trees just as well as boys can. But girls often allow fear to stand in their way.In The Gutsy Girl, author Caroline Paul emboldens girls to seek out a life of exhilaration. Once a young scaredy-cat herself, Caroline decided that fear got in the way of the life she wanted-- Why should girls miss out on the joy of adventure? They can jump off rocks, swing on ropes, and climb trees just as well as boys can. But girls often allow fear to stand in their way.In The Gutsy Girl, author Caroline Paul emboldens girls to seek out a life of exhilaration. Once a young scaredy-cat herself, Caroline decided that fear got in the way of the life she wanted--of excitement, confidence, self-reliance, friendship, and fun. She has since flown planes, rafted big rivers, climbed tall mountains, and fought fires as one of the first female firefighters in San Francisco. In The Gutsy Girl, she shares her greatest escapades as well as those of other girls and women from throughout history, and offers engaging activities such as confidence-building stances, creating a compass, positive self-talk, and using crickets to estimate outside temperatures. Each section includes a place for girls to “journal” their adventures, thus encouraging a new generation to develop a zest for challenges and a healthy relationship to risk. The Gutsy Girl is Lean In for young girls, a book about the glorious things that happen when you unshackle from fear and open up to exhilaration. Fully illustrated and enlivened throughout by bestselling illustrator Wendy MacNaughton's whimsical pen-and-ink drawings. ...more"
    },
    {
        "title": "The Life-Changing Magic of Tidying Up: The Japanese Art of Decluttering and Organizing",
        "price": "£16.77",
        "stock": "16",
        "description": "Despite constant efforts to declutter your home, do papers still accumulate like snowdrifts and clothes pile up like a tangled mess of noodles?Japanese cleaning consultant Marie Kondo takes tidying to a whole new level, promising that if you properly simplify and organize your home once, you'll never have to do it again. Most methods advocate a room-by-room or little-by-li Despite constant efforts to declutter your home, do papers still accumulate like snowdrifts and clothes pile up like a tangled mess of noodles?Japanese cleaning consultant Marie Kondo takes tidying to a whole new level, promising that if you properly simplify and organize your home once, you'll never have to do it again. Most methods advocate a room-by-room or little-by-little approach, which doom you to pick away at your piles of stuff forever. The KonMari Method, with its revolutionary category-by-category system, leads to lasting results. In fact, none of Kondo's clients have lapsed (and she still has a three-month waiting list).With detailed guidance for determining which items in your house \"spark joy\" (and which don't), this international best seller featuring Tokyo's newest lifestyle phenomenon will help you clear your clutter and enjoy the unique magic of a tidy home - and the calm, motivated mindset it can inspire. ...more"
    },
    {
        "title": "Throwing Rocks at the Google Bus: How Growth Became the Enemy of Prosperity",
        "price": "£31.12",
        "stock": "16",
        "description": "Capital in the Twenty-First Century meets The Second Machine Age in this stunning and optimistic tour de force on the promise and peril of the digital economy, from one of the most brilliant social critics of our time. Digital technology was supposed to usher in a new age of endless prosperity, but so far it has been used to put industrial capitalism on steroids, makin Capital in the Twenty-First Century meets The Second Machine Age in this stunning and optimistic tour de force on the promise and peril of the digital economy, from one of the most brilliant social critics of our time. Digital technology was supposed to usher in a new age of endless prosperity, but so far it has been used to put industrial capitalism on steroids, making it harder for people and businesses to keep up. Social networks surrender their original missions to more immediately profitable data mining, while brokerage houses abandon value investing for algorithms that drain markets and our 401ks alike--all tactics driven by the need to stoke growth by any means necessary. Instead of taking this opportunity to reprogram our economy for sustainability, we have doubled down on growth as its core command. We have reached the limits of this approach. We must escape the growth trap, once and for all. Media scholar and technology author Douglas Rushkoff--one of today's most original and influential thinkers--argues for a new economic program that utilizes the unique distributive power of the internet while breaking free of the winner-take-all system the growth trap leaves in its wake. Drawing on sources both contemporary and historical, Rushkoff pioneers a new understanding of the old economic paradigm, from central currency to debt to corporations and labor.Most importantly, he offers a series of practical steps for businesses, consumers, investors, and policymakers to remake the economic operating system from the inside out--and prosper along the way. Instead of boycotting Wal-Mart or overtaxing the wealthy, we simply implement strategies that foster the creation of value by stakeholders other than just ourselves. From our currency to our labor to the corporation, every aspect of the economy can be reprogrammed with minimal disruption to create a more equitably distributed prosperity for all.Inspiring and challenging, Throwing Rocks at the Google Bus provides a pragmatic, optimistic, and human-centered model for economic progress in the digital age. ...more"
    },
    {
        "title": "#HigherSelfie: Wake Up Your Life. Free Your Soul. Find Your Tribe.",
        "price": "£23.11",
        "stock": "17",
        "description": "There is a cosmic alarm clock going off around the world! #HigherSelfie's aim is to unite all those waking up spiritually in this digital age. This book is a guide to love, connection, and kickass surrendered action for young people who have at least a toe in the door of spirituality. With a no-nonsense approach and full of wit and humor, this book shares age-old concepts There is a cosmic alarm clock going off around the world! #HigherSelfie's aim is to unite all those waking up spiritually in this digital age. This book is a guide to love, connection, and kickass surrendered action for young people who have at least a toe in the door of spirituality. With a no-nonsense approach and full of wit and humor, this book shares age-old concepts in a language that is accessible to the modern spiritual audience. Whether you have just bought a yoga mat or have been meditating for years, this book will offer you guidance and support, whatever stage of the journey you're at. Life coaches Jo Westwood and Lucy Sheridan touch upon timeless topics such as forgiveness, surrender and the ego, as well as subjects specific to the current age, such as using social media in a healthy way, finding a like-minded tribe, and following your own spiritual and life paths without comparing yourself to others. Whether you're a Reiki master, climbing the corporate ladder or working in a suburban garden center #HigherSelfie will be the perfect ‘gateway drug’ for those looking for something deeper and more meaningful. ...more"
    },
    {
        "title": "Unseen City: The Majesty of Pigeons, the Discreet Charm of Snails & Other Wonders of the Urban Wilderness",
        "price": "£44.18",
        "stock": "16",
        "description": "It all started with Nathanael Johnson’s decision to teach his daughter the name of every tree they passed on their walk to day care in San Francisco. This project turned into a quest to discover the secrets of the neighborhood’s flora and fauna, and yielded more than names and trivia: Johnson developed a relationship with his nonhuman neighbors.Johnson argues that learning It all started with Nathanael Johnson’s decision to teach his daughter the name of every tree they passed on their walk to day care in San Francisco. This project turned into a quest to discover the secrets of the neighborhood’s flora and fauna, and yielded more than names and trivia: Johnson developed a relationship with his nonhuman neighbors.Johnson argues that learning to see the world afresh, like a child, shifts the way we think about nature: Instead of something distant and abstract, nature becomes real—all at once comical, annoying, and beautiful. This shift can add tremendous value to our lives, and it might just be the first step in saving the world.No matter where we live—city, country, oceanside, ormountains—there are wonders that we walk past every day. Unseen City widens the pinhole of our perspective by allowing us to view the world from the high-altitude eyes of a turkey vulture and the distinctly low-altitude eyes of a snail. The narrative allows us to eavesdrop on the comically frenetic life of a squirrel and peer deep into the past with a ginkgo biloba tree. Each of these organisms has something unique to tell us about our neighborhoods and, chapter by chapter, Unseen City takes us on a journey that is part nature lesson and part love letter to the world’s urban jungles. With the right perspective, a walk to the subway can be every bit as entrancing as a walk through a national park. ...more"
    },
    {
        "title": "Reasons to Stay Alive",
        "price": "£26.41",
        "stock": "17",
        "description": "I want life. I want to read it and write it and feel it and live it. I want, for as much of the time as possible in this blink-of-an-eye existence we have, to feel all that can be felt. I hate depression. I am scared of it. Terrified, in fact. But at the same time, it has made me who I am. And if - for me - it is the price of feeling life, it's a price always worth paying. I want life. I want to read it and write it and feel it and live it. I want, for as much of the time as possible in this blink-of-an-eye existence we have, to feel all that can be felt. I hate depression. I am scared of it. Terrified, in fact. But at the same time, it has made me who I am. And if - for me - it is the price of feeling life, it's a price always worth paying.Reasons to Stay Alive is about making the most of your time on earth. In the western world the suicide rate is highest amongst men under the age of 35. Matt Haig could have added to that statistic when, aged 24, he found himself staring at a cliff-edge about to jump off. This is the story of why he didn't, how he recovered and learned to live with anxiety and depression. It's also an upbeat, joyous and very funny exploration of how live better, love better, read better and feel more. ...more"
    },
    {
        "title": "Behind Closed Doors",
        "price": "£52.22",
        "stock": "18",
        "description": "The 2016 debut bloggers can't stop raving about. Perfect for fans of The Girl on the Train and The Ice Twins Everyone knows a couple like Jack and Grace.He has looks and wealth, she has charm and elegance. You might not want to like them, but you do. Though, you’d like to get to know Grace better.But it’s difficult, because you realise Jack and Grace are never apart.Some The 2016 debut bloggers can't stop raving about. Perfect for fans of The Girl on the Train and The Ice Twins Everyone knows a couple like Jack and Grace.He has looks and wealth, she has charm and elegance. You might not want to like them, but you do. Though, you’d like to get to know Grace better.But it’s difficult, because you realise Jack and Grace are never apart.Some might call this true love. Others might ask why Grace never answers the phone. Or how she can never meet for coffee, even though she doesn’t work. How she can cook such elaborate meals but remain so slim. And why there are bars on one of the bedroom windows.Sometimes, the perfect marriage is the perfect lie. ...more"
    },
    {
        "title": "The Elephant Tree",
        "price": "£23.82",
        "stock": "18",
        "description": "Mark Fallon is an overworked detective investigating a spate of attacks at a string of high profile city centre nightclubs. Scott is a dejected 24 year old struggling to make ends meet working for his brother and supplementing his income with a small-scale drug dealing operation. Angela is an attractive 23 year old, raised by her father, a career criminal and small time dr Mark Fallon is an overworked detective investigating a spate of attacks at a string of high profile city centre nightclubs. Scott is a dejected 24 year old struggling to make ends meet working for his brother and supplementing his income with a small-scale drug dealing operation. Angela is an attractive 23 year old, raised by her father, a career criminal and small time drug dealer who supplies Scott with cannabis. This is a chilling tale spanning a few months in the lives of Scott and Angela, where realizations about the present combine with shocking revelations from the past leading to an apocalyptic climax where they no longer know whom they can trust. ...more"
    },
    {
        "title": "The Five Love Languages: How to Express Heartfelt Commitment to Your Mate",
        "price": "£31.05",
        "stock": "18",
        "description": "Are you and your spouse speaking the same language? While love is a many splendored thing, it is sometimes a very confusing thing, too. And as people come in all varieties, shapes, and sizes, so do their choices of personal expressions of love. But more often than not, the giver and the receiver express love in two different ways. This can lead to misunderstanding, quarrel Are you and your spouse speaking the same language? While love is a many splendored thing, it is sometimes a very confusing thing, too. And as people come in all varieties, shapes, and sizes, so do their choices of personal expressions of love. But more often than not, the giver and the receiver express love in two different ways. This can lead to misunderstanding, quarrels, and even divorce.Quality time, words of affirmation, gifts, acts of service, and physical touch are the five basic love languages. Dr. Gary Chapman identifies these and guides couples towards a better understanding of their unique languages of love. Learn to speak and understand your mate's love language, and in no time you will be able to effectively love and truly feel loved in return. Skillful communication is within your grasp! ...more"
    },
    {
        "title": "The Four Agreements: A Practical Guide to Personal Freedom",
        "price": "£17.66",
        "stock": "18",
        "description": "In The Four Agreements, don Miguel Ruiz reveals the source of self-limiting beliefs that rob us of joy and create needless suffering. Based on ancient Toltec wisdom, the Four Agreements offer a powerful code of conduct that can rapidly transform our lives to a new experience of freedom, true happiness, and love. The Four Agreements are: Be Impeccable With Your Word, Don't In The Four Agreements, don Miguel Ruiz reveals the source of self-limiting beliefs that rob us of joy and create needless suffering. Based on ancient Toltec wisdom, the Four Agreements offer a powerful code of conduct that can rapidly transform our lives to a new experience of freedom, true happiness, and love. The Four Agreements are: Be Impeccable With Your Word, Don't Take Anything Personally, Don't Make Assumptions, Always Do Your Best. ...more"
    },
    {
        "title": "Wall and Piece",
        "price": "£44.18",
        "stock": "18",
        "description": "Banksy, Britain's now-legendary \"guerilla\" street artist, has painted the walls, streets, and bridges of towns and cities throughout the world. Not only did he smuggle his pieces into four of New York City's major art museums, he's also \"hung\" his work at London's Tate Gallery and adorned Israel's West Bank barrier with satirical images. Banksy's identity remains unknown, Banksy, Britain's now-legendary \"guerilla\" street artist, has painted the walls, streets, and bridges of towns and cities throughout the world. Not only did he smuggle his pieces into four of  New York City's major art museums, he's also \"hung\" his work at London's Tate Gallery and adorned Israel's West Bank barrier with satirical images. Banksy's identity remains unknown, but his work is unmistakable—with prints selling for as much as $45,000. ...more"
    },
    {
        "title": "The Bridge to Consciousness: I'm Writing the Bridge Between Science and Our Old and New Beliefs.",
        "price": "£32.00",
        "stock": "15",
        "description": null
    },
    {
        "title": "Worlds Elsewhere: Journeys Around Shakespeare’s Globe",
        "price": "£40.30",
        "stock": "18",
        "description": "Anti-apartheid activist, Bollywood screenwriter, Nazi pin-up, hero of the Wild West: this is Shakespeare as you have never seen him before.From the sixteenth-century Baltic to the American Revolution, from colonial India to the skyscrapers of modern-day Shanghai, Shakespeare’s plays appear at the most fascinating of times and in the most unexpected of places. No other writ Anti-apartheid activist, Bollywood screenwriter, Nazi pin-up, hero of the Wild West: this is Shakespeare as you have never seen him before.From the sixteenth-century Baltic to the American Revolution, from colonial India to the skyscrapers of modern-day Shanghai, Shakespeare’s plays appear at the most fascinating of times and in the most unexpected of places. No other writer’s work has been performed, translated, adapted and altered in such a remarkable variety of cultures and languages. But what is it about William Shakespeare – a man from Warwickshire who never once set foot outside England – that has made him at home in so many places around the globe?Travelling across four continents, six countries and 400 years, Andrew Dickson takes us on a personal journey rich in insight and surprise. We enter the air-conditioned vault deep beneath Capitol Hill where the world’s largest collection of First Folios is stored; discover the shadowy history of Joseph Goebbels’s obsession with Shakespeare; and uncover the true story behind the scuffed edition in which Nelson Mandela and fellow Robben Island prisoners inscribed their names. Both cultural history and literary travelogue, Worlds Elsewhere is an attempt to understand how Shakespeare has become the international phenomenon he is – and why.\"There were very few pages on which I didn’t learn something new or revelatory. A must-read for anyone interested in Shakespeare’s impact on people and politics around the globe\" (James Shapiro, author of 1599: A Year in the Life of William Shakespeare)\"Immensely well-informed and highly readable. A revelatory journey of cultural exploration\" (Professor Stanley Wells, General Editor of the Oxford and Penguin Shakespeares)\"Brilliantly original. Absolutely engaging, witty and irresistible. What’s most remarkable: he’s said something new about Shakespeare\" (Michael Pye, author of The Edge of the World)\"A truly original book about Shakespeare: one that explores the dramatist's global reach with tenacity, devotion and an exhilarating spirit of adventure\" (Michael Billington) ...more"
    },
    {
        "title": "The Emerald Mystery",
        "price": "£23.15",
        "stock": "15",
        "description": "Three young adults are invited to spend a weekend at the exotic Timber Island. Maria is a professional in the sport of bodyboarding. Tina is an apprentice of the sport but very athletic, and she possesses other skills. And lastly there is Axell, a traveler and a veteran bodyboarder. For them, this invitation is extremely attractive because very few people have visited the Three young adults are invited to spend a weekend at the exotic Timber Island. Maria is a professional in the sport of bodyboarding. Tina is an apprentice of the sport but very athletic, and she possesses other skills. And lastly there is Axell, a traveler and a veteran bodyboarder. For them, this invitation is extremely attractive because very few people have visited the place, also known for its secret surf breaks. The adventure sounds irresistible, so they accept the challenge.Once all the guests are on the island, there is only one thing that worries Luis, their host and fellow bodyboarder: to venture out to find a stretch of secret coastline where the young man says they will face majestic wave no one has ever ridden.By this time all of the guests have encountered some very strange things ... and some question whether they are being watched by someone. But who may want to follow them to an island inhabited by only two people, and for what reason? Are these young riders prepared to solve this mystery and accept what they discover as they investigate? Luckily, you'll also be there to accompany them on their journey and reach your own conclusions in this exciting adventure. ...more"
    },
    {
        "title": "The Girl on the Train",
        "price": "£55.02",
        "stock": "15",
        "description": "The debut psychological thriller that will forever change the way you look at other people's lives.EVERY DAY THE SAMERachel takes the same commuter train every morning and night. Every day she rattles down the track, flashes past a stretch of cozy suburban homes, and stops at the signal that allows her to daily watch the same couple breakfasting on their deck. She’s even s The debut psychological thriller that will forever change the way you look at other people's lives.EVERY DAY THE SAMERachel takes the same commuter train every morning and night. Every day she rattles down the track, flashes past a stretch of cozy suburban homes, and stops at the signal that allows her to daily watch the same couple breakfasting on their deck. She’s even started to feel like she knows them. Jess and Jason, she calls them. Their life—as she sees it—is perfect. Not unlike the life she recently lost.UNTIL TODAYAnd then she sees something shocking. It’s only a minute until the train moves on, but it’s enough. Now everything’s changed. Unable to keep it to herself, Rachel goes to the police. But is she really as unreliable as they say? Soon she is deeply entangled not only in the investigation but in the lives of everyone involved. Has she done more harm than good? ...more"
    },
    {
        "title": "The Kite Runner",
        "price": "£41.82",
        "stock": "15",
        "description": "Khaled Hosseini's #1 New York Times Bestselling Debut “It may be unfair, but what happens in a few days, sometimes even a single day, can change the course of a whole lifetime.\" Amir is the son of a wealthy Kabul merchant, a member of the ruling caste of Pashtuns. Hassan, his servant and constant companion, is a Hazara, a despised and impoverished caste. Their uncommon bon Khaled Hosseini's #1 New York Times Bestselling Debut “It may be unfair, but what happens in a few days, sometimes even a single day, can change the course of a whole lifetime.\" Amir is the son of a wealthy Kabul merchant, a member of the ruling caste of Pashtuns. Hassan, his servant and constant companion, is a Hazara, a despised and impoverished caste. Their uncommon bond is torn by Amir's choice to abandon his friend amidst the increasing ethnic, religious, and political tensions of the dying years of the Afghan monarchy, wrenching them far apart. But so strong is the bond between the two boys that Amir journeys back to a distant world, to try to right past wrongs against the only true friend he ever had.The unforgettable, heartbreaking story of the unlikely friendship between a wealthy boy and the son of his father’s servant, The Kite Runner is a beautifully crafted novel set in a country that is in the process of being destroyed. It is about the power of reading, the price of betrayal, and the possibility of redemption; and an exploration of the power of fathers over sons—their love, their sacrifices, their lies.A sweeping story of family, love, and friendship told against the devastating backdrop of the history of Afghanistan over the last thirty years, The Kite Runner is an unusual and powerful novel that has become a beloved, one-of-a-kind classic. ...more"
    },
    {
        "title": "The Psychopath Test: A Journey Through the Madness Industry",
        "price": "£36.00",
        "stock": "15",
        "description": "They say one out of every hundred people is a psychopath. You probably passed one on the street today. These are people who have no empathy, who are manipulative, deceitful, charming, seductive, and delusional. The Psychopath Test is the New York Times bestselling exploration of their world and the madness industry.When Jon Ronson is drawn into an elaborate hoax played on They say one out of every hundred people is a psychopath. You probably passed one on the street today. These are people who have no empathy, who are manipulative, deceitful, charming, seductive, and delusional. The Psychopath Test is the New York Times bestselling exploration of their world and the madness industry.When Jon Ronson is drawn into an elaborate hoax played on some of the world’s top scientists, his investigation leads him, unexpectedly, to psychopaths. He meets an influential psychologist who is convinced that many important business leaders and politicians are in fact high-flying, high-functioning psychopaths, and teaches Ronson how to spot them. Armed with these new abilities, Ronson meets a patient inside an asylum for the criminally insane who insists that he’s sane, a mere run-of-the-mill troubled youth, not a psychopath—a claim that might be only manipulation, and a sign of his psychopathy. He spends time with a death-squad leader institutionalized for mortgage fraud, and with a legendary CEO who took joy in shutting down factories and firing people. He delves into the fascinating history of psychopathy diagnosis and treatments, from LSD-fueled days-long naked therapy sessions in prisons to attempts to understand serial killers.Along the way, Ronson discovers that relatively ordinary people are, more and more, defined by their most insane edges. The Psychopath Test is a fascinating adventure through the minds of madness. ...more"
    },
    {
        "title": "Having the Barbarian's Baby (Ice Planet Barbarians #7.5)",
        "price": "£34.96",
        "stock": "1",
        "description": "Megan’s ready to give birth, but she’s not ready to let her mate leave her side. When Cashol must go hunting to feed the tribe, they’re separated for the first time since resonance. Not a problem, except the baby’s ready to be born and there’s a storm brewing… This is a short story set in the ICE PLANET BARBARIANS world. It does not stand alone, and is intended to be read Megan’s ready to give birth, but she’s not ready to let her mate leave her side. When Cashol must go hunting to feed the tribe, they’re separated for the first time since resonance. Not a problem, except the baby’s ready to be born and there’s a storm brewing…   This is a short story set in the ICE PLANET BARBARIANS world. It does not stand alone, and is intended to be read after BARBARIAN’S MATE. It’s a little bit of sweetness for those that can’t get enough of the big blue aliens! Happy reading! ...more"
    },
    {
        "title": "The Last Girl (The Dominion Trilogy #1)",
        "price": "£36.26",
        "stock": "1",
        "description": "A mysterious worldwide epidemic reduces the birthrate of female infants from 50 percent to less than 1 percent. Medical science and governments around the world scramble in an effort to solve the problem, but twenty-five years later there is no cure, and an entire generation grows up with a population of fewer than a thousand women.Zoey and some of the surviving young wome A mysterious worldwide epidemic reduces the birthrate of female infants from 50 percent to less than 1 percent. Medical science and governments around the world scramble in an effort to solve the problem, but twenty-five years later there is no cure, and an entire generation grows up with a population of fewer than a thousand women.Zoey and some of the surviving young women are housed in a scientific research compound dedicated to determining the cause. For two decades, she’s been isolated from her family, treated as a test subject, and locked away—told only that the virus has wiped out the rest of the world’s population.Captivity is the only life Zoey has ever known, and escaping her heavily armed captors is no easy task, but she’s determined to leave before she is subjected to the next round of tests…a program that no other woman has ever returned from. Even if she’s successful, Zoey has no idea what she’ll encounter in the strange new world beyond the facility’s walls. Winning her freedom will take brutality she never imagined she possessed, as well as all her strength and cunning—but Zoey is ready for war. ...more"
    },
    {
        "title": "Three Wishes (River of Time: California #1)",
        "price": "£44.18",
        "stock": "1",
        "description": "BE CAREFUL WHAT YOU WISH FOR. BECAUSE YOU JUST MIGHT GET IT. Zara Ruiz is a normal California girl on the verge of graduating high school and thinking about her dawning future. But when dusk brings a shattering loss—and she discovers a priceless object in the shallows of a tide pool—she is thrust a hundred-and-eighty years into the past. There she meets handsome ranchero J BE CAREFUL WHAT YOU WISH FOR. BECAUSE YOU JUST MIGHT GET IT. Zara Ruiz is a normal California girl on the verge of graduating high school and thinking about her dawning future. But when dusk brings a shattering loss—and she discovers a priceless object in the shallows of a tide pool—she is thrust a hundred-and-eighty years into the past. There she meets handsome ranchero Javier de la Ventura—who has big dreams and bigger secrets—along with his enchanting family, in a land that is at once familiar, and yet utterly foreign. Between cattle rustlers, pirates and a growing call for statehood, it is not a peaceful time to be a Mexican settler in young Alta California. But it is in that time and place that Zara must decide if she can find what she longs for most in the past, or if her heart's THREE WISHES can only be resolved in the present. ...more"
    },
    {
        "title": "The Secret (The Secret #1)",
        "price": "£27.37",
        "stock": "15",
        "description": "Fragments of a Great Secret have been found in the oral traditions, in literature, in religions and philosophies throughout the centuries. For the first time, all the pieces of The Secret come together in an incredible revelation that will be life-transforming for all who experience it. In this book, you'll learn how to use The Secret in every aspect of your life -- money Fragments of a Great Secret have been found in the oral traditions, in literature, in religions and philosophies throughout the centuries. For the first time, all the pieces of The Secret come together in an incredible revelation that will be life-transforming for all who experience it. In this book, you'll learn how to use The Secret in every aspect of your life -- money, health, relationships, happiness, and in every interaction you have in the world. You'll begin to understand the hidden, untapped power that's within you, and this revelation can bring joy to every aspect of your life. The Secret contains wisdom from modern-day teachers -- men and women who have used it to achieve health, wealth, and happiness. By applying the knowledge of The Secret, they bring to light compelling stories of eradicating disease, acquiring massive wealth, overcoming obstacles, and achieving what many would regard as impossible. ...more"
    },
    {
        "title": "Thirteen Reasons Why",
        "price": "£52.72",
        "stock": "15",
        "description": "Clay Jensen returns home from school to find a mysterious box with his name on it lying on his porch. Inside he discovers thirteen cassette tapes recorded by Hannah Baker, his classmate and crush who committed suicide two weeks earlier. On tape, Hannah explains that there are thirteen reasons why she decided to end her life. Clay is one of them. If he listens, he'll find o Clay Jensen returns home from school to find a mysterious box with his name on it lying on his porch. Inside he discovers thirteen cassette tapes recorded by Hannah Baker, his classmate and crush who committed suicide two weeks earlier. On tape, Hannah explains that there are thirteen reasons why she decided to end her life. Clay is one of them. If he listens, he'll find out how he made the list. Through Hannah and Clay's dual narratives, debut author Jay Asher weaves an intricate and heartrending story of confusion and desperation that will deeply affect teen readers. ...more"
    },
    {
        "title": "Do Androids Dream of Electric Sheep? (Blade Runner #1)",
        "price": "£51.48",
        "stock": "3",
        "description": "By 2021, the World War has killed millions, driving entire species into extinction and sending mankind off-planet. Those who remain covet any living creature, and for people who can't afford one, companies have built incredibly realistic simulacrae: horses, birds, cats, sheep. They've even built humans.Emigrées to Mars receive androids so sophisticated it's impossible to t By 2021, the World War has killed millions, driving entire species into extinction and sending mankind off-planet. Those who remain covet any living creature, and for people who can't afford one, companies have built incredibly realistic simulacrae: horses, birds, cats, sheep. They've even built humans.Emigrées to Mars receive androids so sophisticated it's impossible to tell them from true men or women. Fearful of the havoc these artificial humans could wreak, the government bans them from Earth, but when androids don't want to be identified, they just blend in. Rick Deckard is an officially sanctioned bounty hunter whose job is to find rogue androids and retire them, but cornered, androids tend to fight back--with deadly results. ...more"
    },
    {
        "title": "Abstract City",
        "price": "£56.37",
        "stock": "14",
        "description": "In July 2008, illustrator and designer Christoph Niemann began Abstract City, a visual blog for the New York Times. His posts were inspired by the desire to re-create simple and everyday observations and stories from his own life that everyone could relate to. In Niemann’s hands, mundane experiences such as riding the subway or trying to get a good night’s sleep were trans In July 2008, illustrator and designer Christoph Niemann began Abstract City, a visual blog for the New York Times. His posts were inspired by the desire to re-create simple and everyday observations and stories from his own life that everyone could relate to. In Niemann’s hands, mundane experiences such as riding the subway or trying to get a good night’s sleep were transformed into delightful flights of visual fancy. The struggle to keep up with housework became a battle against adorable but crafty goblins, and nostalgia about New York manifested in simple but strikingly spot-on LEGO creations. This brilliantly illustrated collection of reflections on modern life includes all 16 of the original blog posts as well as a new chapter created exclusively for the book. Also available from Christoph Niemann: Sunday Sketching and I LEGO N.Y. Praise for Abstract City: “Everyday experiences—from looking at leaves to riding city subways—are funny and fresh and often a source of wonder when depicted by this brilliant graphic designer.” —Readers Digest “I will call Christoph when anything awful happens to me. And he will make me laugh like crazy about the whole thing. Because he is insanely funny and completely tenderly true. I love every column he did and will do.” —Maira Kalman, author/illustrator of And the Pursuit of Happiness “Christoph Niemann is the best illustrator alive. Every single time I come across a piece of his work, which is often as he either works all the time, or worse, draws incredibly fast, it is wonderful. While the rest of us are lucky to get a proper piece out here and there, Christoph produces hit after hit after hit. If he wasn’t such a genuinely sweet man, we’d surely hate his ass a lot.” —Stefan Sagmeister, author of Things I Have Learned in My Life So Far “Few books have more probingly and humorously gotten inside the mind and day-to-day experience of an artist.” —NPR.org \"What’s terrifying (to me, certainly, and possibly to many of his peers) is that nearly every idea he has seems to be equally well formed . . . once again, performing neat, virtuosic circles around the rest of us, to our delight.\" —PRINT magazine \"Irresistible.\" —Very Short List “A masterpiece of sophisticated humor, this is a brilliant one-of-a-kind work.” —Library Journal, starred review ...more"
    },
    {
        "title": "13 Hours: The Inside Account of What Really Happened In Benghazi",
        "price": "£27.06",
        "stock": "13",
        "description": "The harrowing, true account from the brave men on the ground who fought back during the Battle of Benghazi. 13 HOURS presents, for the first time ever, the true account of the events of September 11, 2012, when terrorists attacked the US State Department Special Mission Compound and a nearby CIA station called the Annex in Benghazi, Libya. A team of six American security The harrowing, true account from the brave men on the ground who fought back during the Battle of Benghazi. 13 HOURS presents, for the first time ever, the true account of the events of September 11, 2012, when terrorists attacked the US State Department Special Mission Compound and a nearby CIA station called the Annex in Benghazi, Libya. A team of six American security operators fought to repel the attackers and protect the Americans stationed there. Those men went beyond the call of duty, performing extraordinary acts of courage and heroism, to avert tragedy on a much larger scale. This is their personal account, never before told, of what happened during the thirteen hours of that now-infamous attack.13 HOURS sets the record straight on what happened during a night that has been shrouded in mystery and controversy. Written by New York Times bestselling author Mitchell Zuckoff, this riveting book takes readers into the action-packed story of heroes who laid their lives on the line for one another, for their countrymen, and for their country.13 HOURS is a stunning, eye-opening, and intense book--but most importantly, it is the truth. The story of what happened to these men--and what they accomplished--is unforgettable. ...more"
    },
    {
        "title": "Buying In: The Secret Dialogue Between What We Buy and Who We Are",
        "price": "£37.80",
        "stock": "14",
        "description": "“Fascinating … A compelling blend of cultural anthropology and business journalism.” — Andrea Sachs, Time Magazine “An often startling tour of new cultural terrain.” — Laura Miller, Salon “Marked by meticulous research and careful conclusions, this superbly readable book confirms New York Times journalist Walker as an expert on consumerism. … [A] thoughtful and unhurried i “Fascinating … A compelling blend of cultural anthropology and business journalism.” — Andrea Sachs, Time Magazine “An often startling tour of new cultural terrain.” — Laura Miller, Salon “Marked by meticulous research and careful conclusions, this superbly readable book confirms New York Times journalist Walker as an expert on consumerism. … [A] thoughtful and unhurried investigation into consumerism that pushes the analysis to the maximum…” — Publisher’s Weekly (starred review) Brands are dead. Advertising no longer works. Weaned on TiVo, the Internet, and other emerging technologies, the short-attention-span generation has become immune to marketing. Consumers are “in control.” Or so we’re told.In Buying In, New York Times Magazine “Consumed” columnist Rob Walker argues that this accepted wisdom misses a much more important and lasting cultural shift. As technology has created avenues for advertising anywhere and everywhere, people are embracing brands more than ever before–creating brands of their own and participating in marketing campaigns for their favorite brands in unprecedented ways. Increasingly, motivated consumers are pitching in to spread the gospel virally, whether by creating Internet video ads for Converse All Stars or becoming word-of-mouth “agents” touting products to friends and family on behalf of huge corporations. In the process, they–we–have begun to funnel cultural, political, and community activities through connections with brands. Walker explores this changing cultural landscape–including a practice he calls “murketing,” blending the terms murky and marketing–by introducing us to the creative marketers, entrepreneurs, artists, and community organizers who have found a way to thrive within it. Using profiles of brands old and new, including Timberland, American Apparel, Pabst Blue Ribbon, Red Bull, iPod, and Livestrong, Walker demonstrates the ways in which buyers adopt products, not just as consumer choices, but as conscious expressions of their identities. Part marketing primer, part work of cultural anthropology, Buying In reveals why now, more than ever, we are what we buy–and vice versa. Praise for Buying In “Walker … makes a startling claim: Far from being immune to advertising, as many people think, American consumers are increasingly active participants in the marketing process. … [He] leads readers through a series of lucid case studies to demonstrate that, in many cases, consumers actively participate in infusing a brand with meaning. … Convincing.” — Jay Dixit, The Washington Post “Walker lays out his theory in well-written, entertaining detail.” — Seth Stevenson, Slate “Buying In delves into the attitudes of the global consumer in the age of plenty, and, well, we aren’t too pretty. Walker carries the reader on a frenetically paced tour of senseless consumption spanning from Viking ranges to custom high-tops.” — Robert Blinn, Core77 “Rob Walker is one smart shopper.” — Jen Trolio, ReadyMade “The most trenchant psychoanalyst of our consumer selves is Rob Walker. This is a fresh and fascinating exploration of the places where material culture and identity intersect.” –Michael Pollan, author of In Defense of Food “This book has vast social implications, far beyond the fields of marketing and branding. It obliterates our old paradigm of companies (the bad guys) corrupting our children (the innocents) via commercials. In this new world, media-literate young people freely and willingly co-opt the brands, and most companies are clueless bystanders desperate to keep up. I really don't know if this is good news or bad news, but I can say, with certainty, that this book is a must-read.”–Po Bronson, author of What Should I Do with My Life? “Rob Walker is a gift. He shows that in our shattered, scattered world, powerful brands are existential, insinuating themselves into the human questions ‘What am I about?’ and ‘How do I connect?’ His insight that brand influence is becoming both more pervasive and more hidden–that we are not so self-defined as we like to think–should make us disturbed, and vigilant.”–Jim Collins, author of Good to Great“Rob Walker is a terrific writer who understands both human nature and the business world. His book is highly entertaining, but it’s also a deeply thoughtful look at the ways in which marketing meets the modern psyche.”–Bethany McLean, editor at large, Fortune, and co-author of The Smartest Guys in the Room“Are we living in an era of YouTube-empowered, brand-rejecting consumers? Rob Walker has the surprising answers, and you won’t want to miss this joyride through the front lines of consumer culture. A marketing must-read.”–Chip Heath and Dan Heath, authors of Made to Stick “Rob Walker brilliantly deconstructs the religion of consumption. Love his column, couldn’t put his book down.”–Paco Underhill, author of Why We Buy ...more"
    },
    {
        "title": "Brain on Fire: My Month of Madness",
        "price": "£49.32",
        "stock": "14",
        "description": "An award-winning memoir and instant New York Times bestseller that goes far beyond its riveting medical mystery, Brain on Fire is the powerful account of one woman’s struggle to recapture her identity.When twenty-four-year-old Susannah Cahalan woke up alone in a hospital room, strapped to her bed and unable to move or speak, she had no memory of how she’d gotten there. Day An award-winning memoir and instant New York Times bestseller that goes far beyond its riveting medical mystery, Brain on Fire is the powerful account of one woman’s struggle to recapture her identity.When twenty-four-year-old Susannah Cahalan woke up alone in a hospital room, strapped to her bed and unable to move or speak, she had no memory of how she’d gotten there. Days earlier, she had been on the threshold of a new, adult life: at the beginning of her first serious relationship and a promising career at a major New York newspaper. Now she was labeled violent, psychotic, a flight risk. What happened?In a swift and breathtaking narrative, Cahalan tells the astonishing true story of her descent into madness, her family’s inspiring faith in her, and the lifesaving diagnosis that nearly didn’t happen. ...more"
    },
    {
        "title": "Eaternity: More than 150 Deliciously Easy Vegan Recipes for a Long, Healthy, Satisfied, Joyful Life",
        "price": "£51.75",
        "stock": "14",
        "description": "Vegan chef and wellness expert Jason Wrobel offers up a comprehensive recipe and lifestyle book with practical tips for creating drool-worthy dishes with specific nutritional benefits. While at its core Eaternity is a cookbook, it’s so much more than that. In it, Jason explains which foods contain active ingredients to support health and longevity. Now, you might be thinki Vegan chef and wellness expert Jason Wrobel offers up a comprehensive recipe and lifestyle book with practical tips for creating drool-worthy dishes with specific nutritional benefits. While at its core Eaternity is a cookbook, it’s so much more than that. In it, Jason explains which foods contain active ingredients to support health and longevity. Now, you might be thinking, “What’s the big deal about living a long time?” Well, if you’re having a pretty good time here on planet Earth, wouldn’t you want to stick around as long as possible to enjoy it? And wouldn’t you want to feel great the entire time?  Unlike most cookbooks that merely tell you what to eat and how to make it, Eaternity gives you the current research and science behind common public health concerns, and explains why you should eat certain foods based on your individual goals—whether it’s to lose weight, have more energy, sleep sounder, feel stronger, or get your libido running (ooh, la la!).Eaternity has 150+ nutritious yet delicious meat-free recipes that will satisfy all of your insane comfort-food cravings, because let’s face it—not everyone is ready for wheatgrass shots, seaweed salads, and buckwheat granola! It features such fan favorites as Chocolate Avocado Jungle Peanut Pudding, Superfood Caesar Salad, Coconut Milk Asparagus Risotto, Spicy Sweet Potato Tortilla Soup, and—wait for it—Salted Caramel Waffles. One bite and you’ll be obsessed, Jess. With a refreshingly light, no-pressure vibe, wicked humor, and stunning food photography, Eaternity makes it easy to get on board and feel friggin’ awesome! It’s Nutrition 101 meets jaw-dropping food porn, taught by a comedian in a chef’s coat. Boom! ...more"
    },
    {
        "title": "Hamilton: The Revolution",
        "price": "£58.79",
        "stock": "14",
        "description": "Lin-Manuel Miranda's groundbreaking musical Hamilton is as revolutionary as its subject, the poor kid from the Caribbean who fought the British, defended the Constitution, and helped to found the United States. Fusing hip-hop, pop, R&B, and the best traditions of theater, this once-in-a-generation show broadens the sound of Broadway, reveals the storytelling power of r Lin-Manuel Miranda's groundbreaking musical Hamilton is as revolutionary as its subject, the poor kid from the Caribbean who fought the British, defended the Constitution, and helped to found the United States. Fusing hip-hop, pop, R&B, and the best traditions of theater, this once-in-a-generation show broadens the sound of Broadway, reveals the storytelling power of rap, and claims our country's origins for a diverse new generation.HAMILTON: THE REVOLUTION gives readers an unprecedented view of both revolutions, from the only two writers able to provide it. Miranda, along with Jeremy McCarter, a cultural critic and theater artist who was involved in the project from its earliest stages--\"since before this was even a show,\" according to Miranda--traces its development from an improbable perfor­mance at the White House to its landmark opening night on Broadway six years later. In addition, Miranda has written more than 200 funny, revealing footnotes for his award-winning libretto, the full text of which is published here.Their account features photos by the renowned Frank Ockenfels and veteran Broadway photographer, Joan Marcus; exclusive looks at notebooks and emails; interviews with Questlove, Stephen Sond­heim, leading political commentators, and more than 50 people involved with the production; and multiple appearances by Presi­dent Obama himself. The book does more than tell the surprising story of how a Broadway musical became a national phenomenon: It demonstrates that America has always been renewed by the brash upstarts and brilliant outsiders, the men and women who don't throw away their shot. ...more"
    },
    {
        "title": "Far & Away: Places on the Brink of Change: Seven Continents, Twenty-Five Years",
        "price": "£15.06",
        "stock": "14",
        "description": "From the winner of the National Book Award and the National Books Critics’ Circle Award—and one of the most original thinkers of our time—a riveting collection of essays about places in dramatic transition.Far and Away collects Andrew Solomon’s writings about places undergoing seismic shifts—political, cultural, and spiritual. Chronicling his stint on the barricades in Mos From the winner of the National Book Award and the National Books Critics’ Circle Award—and one of the most original thinkers of our time—a riveting collection of essays about places in dramatic transition.Far and Away collects Andrew Solomon’s writings about places undergoing seismic shifts—political, cultural, and spiritual. Chronicling his stint on the barricades in Moscow in 1991, when he joined artists in resisting the coup whose failure ended the Soviet Union, his 2002 account of the rebirth of culture in Afghanistan following the fall of the Taliban, his insightful appraisal of a Myanmar seeped in contradictions as it slowly, fitfully pushes toward freedom, and many other stories of profound upheaval, this book provides a unique window onto the very idea of social change. With his signature brilliance and compassion, Solomon demonstrates both how history is altered by individuals, and how personal identities are altered when governments alter.A journalist and essayist of remarkable perception and prescience, Solomon captures the essence of these cultures. Ranging across seven continents and twenty-five years, Far and Away takes a magnificent journey into the heart of extraordinarily diverse experiences, yet Solomon finds a common humanity wherever he travels. Illuminating the development of his own genius, his stories are always intimate and often both funny and deeply moving. ...more"
    },
    {
        "title": "Let It Out: A Journey Through Journaling",
        "price": "£26.79",
        "stock": "14",
        "description": "You want change. Maybe your career isn’t what you thought it would be . . . or your relationships aren’t what you had hoped. Perhaps you have a grand vision for your life but not the smallest clue on the steps to get there. Whether you’ve read the entire self-help section of the bookstore in vain or feel completely stuck on where to begin, you wish you had someone to hold You want change. Maybe your career isn’t what you thought it would be . . . or your relationships aren’t what you had hoped. Perhaps you have a grand vision for your life but not the smallest clue on the steps to get there. Whether you’ve read the entire self-help section of the bookstore in vain or feel completely stuck on where to begin, you wish you had someone to hold your hand and guide you.You do. And it’s only a blank page away.In Let It Out, millennial blogger, speaker, and podcast host Katie Dalebout shares the transformative practice that will rocket your life to the next level—journaling. Discovering in her darkest hours that a journal is the greatest tool in finding your purpose, healing yourself, and creating the life you most desire, Katie has assembled the remarkable tools and insights that will elevate your life and get you “unstuck”—for good.And don’t worry—you don’t need to be a writer! Journaling is simply a method of coaching yourself through your “stuff” and letting it out on the page, unclogging your mind from years of destructive thoughts. In doing so, you step into a position of unsurpassed clarity.Packed with journaling exercises, prompts, and techniques that can be done anywhere and in any order, this interactive guidebook offers you a new way to navigate your daily life, cope with stress, and create exciting, permanent change. Divided into seven sections covering everything from clearing clutter to finding presence to cultivating abundance to moving beyond fear, this book will be your new best friend and coach anytime you seek clarity or crave solace.Simply grab a pen, open your journal, and prepare to let it out.  ...more"
    }
]